Revit 2024 API
SpotLightDistribution Constructor (Double, Double, Double)
 Creates a spot light distribution object with the given values.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public SpotLightDistribution(
	double spotBeamAngle,
	double spotFieldAngle,
	double tiltAngle
)
Visual Basic
Public Sub New ( _
	spotBeamAngle As Double, _
	spotFieldAngle As Double, _
	tiltAngle As Double _
)
Visual C++
public:
SpotLightDistribution(
	double spotBeamAngle,
	double spotFieldAngle,
	double tiltAngle
)
Parameters
spotBeamAngle
Type: System.Double
 The spot beam angle as a numerical value in radians between 0 and (8/9)*PI.
spotFieldAngle
Type: System.Double
 The spot field angle as a numerical value in radians between 0 and (8/9)*PI.
tiltAngle
Type: System.Double
 The tilt angle as a numerical value in radians between -PI and PI.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The angle is not valid because it is not between 1.0e-2 and 160.0. -or- The angle is not valid because it is not between -180.0 and 180.0.
See Also
SpotLightDistribution Class
SpotLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace